<a href="https://colab.research.google.com/github/kalluv/Codeforces---Python-solutions/blob/main/Data_cleaning_a3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Reading files and storing them into dataframes

In [ ]:
import pandas as pd

In [ ]:
df1 = pd.read_csv('2022-A3-1.csv')

I read the the first file in (read_csv)

In [ ]:
df1.head()

,Area Code,Area,Item Code,Item,Y2000,Y2000F,Y2001,Y2001F,Y2002,Y2002F,Y2003,Y2003F,Y2004,Y2004F,Y2005,Y2005F
0,3,Albania,515,Apples,12000,NaN,15794,NaN,15800,NaN,13300,NaN,15000,NaN,16000,NaN
1,3,Albania,526,Apricots,670,NaN,1581,NaN,2000,F,2200,F,1800,F,2000,F
2,3,Albania,531,Cherries,5000,NaN,6800,NaN,6000,NaN,6300,NaN,6900,NaN,7200,NaN
3,3,Albania,530,"Cherries, sour",8300,NaN,10370,Im,13200,F,15400,F,12000,F,14000,F
4,3,Albania,577,Dates,NaN,M,NaN,M,NaN,M,NaN,M,5800,NaN,6590,NaN

I checked the file looked okay using (head).

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1042 entries, 0 to 1041
Data columns (total 16 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Area Code  1042 non-null   int64
 1   Area       1042 non-null   object
 2   Item Code  1042 non-null   int64
 3   Item       1042 non-null   object
 4   Y2000      605 non-null    object
 5   Y2000F     265 non-null    object
 6   Y2001      606 non-null    object
 7   Y2001F     252 non-null    object
 8   Y2002      612 non-null    object
 9   Y2002F     260 non-null    object
 10  Y2003      629 non-null    object
 11  Y2003F     223 non-null    object
 12  Y2004      638 non-null    object
 13  Y2004F     228 non-null    object
 14  Y2005      641 non-null    object
 15  Y2005F     214 non-null    object
dtypes: int64(2), object(14)
memory usage: 130.4+ KB

I wanted to know what the data types were for each columns, so I used (info).

In [ ]:
df2 = pd.read_excel('2022-A3-2.xlsx')

I read the second file using (read_excel).

In [ ]:
df2.head()

,Area Code,Area,Item Code,Item,Y2005,Y2005F,Y2006,Y2006F,Y2007,Y2007F,...,Y2011,Y2011F,Y2012,Y2012F,Y2013,Y2013F,Y2014,Y2014F,Y2015,Y2015F
0,3,Albania,515,Apples,16000.0,NaN,27566.0,NaN,36000.0,NaN,...,64000.0,NaN,71300.0,NaN,75730.0,NaN,82060.0,NaN,91736.0,NaN
1,3,Albania,526,Apricots,2000.0,F,1900.0,NaN,2000.0,NaN,...,3900.0,NaN,4430.0,NaN,4400.0,NaN,4140.0,NaN,5045.0,NaN
2,3,Albania,531,Cherries,7200.0,NaN,7680.0,NaN,7500.0,NaN,...,14400.0,NaN,16970.0,NaN,18920.0,NaN,17730.0,NaN,20147.0,NaN
3,3,Albania,530,"Cherries, sour",14000.0,F,13600.0,F,13000.0,F,...,17000.0,*,17000.0,F,17000.0,F,17000.0,F,17495.0,Im
4,3,Albania,577,Dates,6590.0,NaN,7900.0,NaN,8000.0,NaN,...,11586.0,NaN,12120.0,NaN,12250.0,NaN,12180.0,NaN,13599.0,NaN

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1042 entries, 0 to 1041
Data columns (total 26 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Area Code  1042 non-null   int64
 1   Area       1042 non-null   object
 2   Item Code  1042 non-null   int64
 3   Item       1042 non-null   object
 4   Y2005      693 non-null    float64
 5   Y2005F     214 non-null    object
 6   Y2006      709 non-null    float64
 7   Y2006F     225 non-null    object
 8   Y2007      710 non-null    float64
 9   Y2007F     224 non-null    object
 10  Y2008      710 non-null    float64
 11  Y2008F     225 non-null    object
 12  Y2009      710 non-null    float64
 13  Y2009F     218 non-null    object
 14  Y2010      710 non-null    float64
 15  Y2010F     206 non-null    object
 16  Y2011      710 non-null    float64
 17  Y2011F     209 non-null    object
 18  Y2012      710 non-null    float64
 19  Y2012F     204 non-null    object
 20  Y2013      710 non-null    float64
 21  Y2013F     205 non-null    object
 22  Y2014      710 non-null    float64
 23  Y2014F     204 non-null    object
 24  Y2015      710 non-null    float64
 25  Y2015F     205 non-null    object
dtypes: float64(11), int64(2), object(13)
memory usage: 211.8+ KB

I repeated the same process as I did with the first file and used (head) and (info).

In [ ]:
df1.pop('Y2005')
df1.pop('Y2005F')

0       NaN
1         F
2       NaN
3         F
4       NaN
       ...
1037    NaN
1038    NaN
1039    NaN
1040    NaN
1041      A
Name: Y2005F, Length: 1042, dtype: object

Before merging the two files, I decided that it would be best to drop the columns 'Y2005' and 'Y2005F' in df1 and keep them in df2. I chose to drop the columns in df1 rather than df2, since the column 'Y2005' in df2, has more values then the same column in df1.

In [ ]:
df2 = df2.drop(df2.columns[[0, 1, 2, 3]],axis = 1)

I also dropped the first 4 columns in df2, since they are already there in df1.

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1042 entries, 0 to 1041
Data columns (total 22 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Y2005   693 non-null    float64
 1   Y2005F  214 non-null    object
 2   Y2006   709 non-null    float64
 3   Y2006F  225 non-null    object
 4   Y2007   710 non-null    float64
 5   Y2007F  224 non-null    object
 6   Y2008   710 non-null    float64
 7   Y2008F  225 non-null    object
 8   Y2009   710 non-null    float64
 9   Y2009F  218 non-null    object
 10  Y2010   710 non-null    float64
 11  Y2010F  206 non-null    object
 12  Y2011   710 non-null    float64
 13  Y2011F  209 non-null    object
 14  Y2012   710 non-null    float64
 15  Y2012F  204 non-null    object
 16  Y2013   710 non-null    float64
 17  Y2013F  205 non-null    object
 18  Y2014   710 non-null    float64
 19  Y2014F  204 non-null    object
 20  Y2015   710 non-null    float64
 21  Y2015F  205 non-null    object
dtypes: float64(11), object(11)
memory usage: 179.2+ KB

This is df2 after the first 4 columns have been dropped.

# Merging dataframes

In [ ]:
df3 = pd.concat([df1, df2], axis=1)

I merged df1 and df2 and stored them in a new dataframe called 'df3'.

In [ ]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1042 entries, 0 to 1041
Data columns (total 36 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Area Code  1042 non-null   int64
 1   Area       1042 non-null   object
 2   Item Code  1042 non-null   int64
 3   Item       1042 non-null   object
 4   Y2000      605 non-null    object
 5   Y2000F     265 non-null    object
 6   Y2001      606 non-null    object
 7   Y2001F     252 non-null    object
 8   Y2002      612 non-null    object
 9   Y2002F     260 non-null    object
 10  Y2003      629 non-null    object
 11  Y2003F     223 non-null    object
 12  Y2004      638 non-null    object
 13  Y2004F     228 non-null    object
 14  Y2005      693 non-null    float64
 15  Y2005F     214 non-null    object
 16  Y2006      709 non-null    float64
 17  Y2006F     225 non-null    object
 18  Y2007      710 non-null    float64
 19  Y2007F     224 non-null    object
 20  Y2008      710 non-null    float64
 21  Y2008F     225 non-null    object
 22  Y2009      710 non-null    float64
 23  Y2009F     218 non-null    object
 24  Y2010      710 non-null    float64
 25  Y2010F     206 non-null    object
 26  Y2011      710 non-null    float64
 27  Y2011F     209 non-null    object
 28  Y2012      710 non-null    float64
 29  Y2012F     204 non-null    object
 30  Y2013      710 non-null    float64
 31  Y2013F     205 non-null    object
 32  Y2014      710 non-null    float64
 33  Y2014F     204 non-null    object
 34  Y2015      710 non-null    float64
 35  Y2015F     205 non-null    object
dtypes: float64(11), int64(2), object(23)
memory usage: 293.2+ KB

This is the new dataframe df3, which was made from merging df1 and df2.

In [ ]:
df4 = pd.read_json('2022-A3-3.json')

I read the third and last file using (read_json).

In [ ]:
df4.head()

,Item Code,Fruit,Area Code,Area,Y2016,Y2016F,Y2017,Y2017F,Y2018,Y2018F,Y2019,Y2019F,Y2020,Y2020F
0,515,Apples,3,Albania,101532,,96338,,108375,,105933,,102167,
1,515,Apples,11,Austria,101667,,185244,,387950,,239210,,258220,
2,515,Apples,27,Bulgaria,44755,,44927,,50300,,43620,,37870,
3,515,Apples,54,Denmark,36470,,20496,,32650,,25210,,40020,
4,515,Apples,57,Belarus,508816,,317078,,700198,,336697,,532655,

In [ ]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1041 entries, 0 to 1040
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Item Code  1041 non-null   int64
 1   Fruit      1041 non-null   object
 2   Area Code  1041 non-null   int64
 3   Area       1041 non-null   object
 4   Y2016      1041 non-null   object
 5   Y2016F     1041 non-null   object
 6   Y2017      1041 non-null   object
 7   Y2017F     1041 non-null   object
 8   Y2018      1041 non-null   object
 9   Y2018F     1041 non-null   object
 10  Y2019      1041 non-null   object
 11  Y2019F     1041 non-null   object
 12  Y2020      1041 non-null   object
 13  Y2020F     1041 non-null   object
dtypes: int64(2), object(12)
memory usage: 122.0+ KB

I repeated the same steps as I did with first 2 files and used (head) and (info).

In [ ]:
df4 = df4.drop(df4.columns[[0, 1, 2, 3]],axis = 1)

I dropped the first 4 columns in df4, before merging it with df3, since the first 4 columns match.

In [ ]:
df3 = pd.concat([df3, df4], axis=1)

I merged the df3 and df4 and stored them into the dataframe df3.

In [ ]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1042 entries, 0 to 1041
Data columns (total 46 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Area Code  1042 non-null   int64
 1   Area       1042 non-null   object
 2   Item Code  1042 non-null   int64
 3   Item       1042 non-null   object
 4   Y2000      605 non-null    object
 5   Y2000F     265 non-null    object
 6   Y2001      606 non-null    object
 7   Y2001F     252 non-null    object
 8   Y2002      612 non-null    object
 9   Y2002F     260 non-null    object
 10  Y2003      629 non-null    object
 11  Y2003F     223 non-null    object
 12  Y2004      638 non-null    object
 13  Y2004F     228 non-null    object
 14  Y2005      693 non-null    float64
 15  Y2005F     214 non-null    object
 16  Y2006      709 non-null    float64
 17  Y2006F     225 non-null    object
 18  Y2007      710 non-null    float64
 19  Y2007F     224 non-null    object
 20  Y2008      710 non-null    float64
 21  Y2008F     225 non-null    object
 22  Y2009      710 non-null    float64
 23  Y2009F     218 non-null    object
 24  Y2010      710 non-null    float64
 25  Y2010F     206 non-null    object
 26  Y2011      710 non-null    float64
 27  Y2011F     209 non-null    object
 28  Y2012      710 non-null    float64
 29  Y2012F     204 non-null    object
 30  Y2013      710 non-null    float64
 31  Y2013F     205 non-null    object
 32  Y2014      710 non-null    float64
 33  Y2014F     204 non-null    object
 34  Y2015      710 non-null    float64
 35  Y2015F     205 non-null    object
 36  Y2016      1041 non-null   object
 37  Y2016F     1041 non-null   object
 38  Y2017      1041 non-null   object
 39  Y2017F     1041 non-null   object
 40  Y2018      1041 non-null   object
 41  Y2018F     1041 non-null   object
 42  Y2019      1041 non-null   object
 43  Y2019F     1041 non-null   object
 44  Y2020      1041 non-null   object
 45  Y2020F     1041 non-null   object
dtypes: float64(11), int64(2), object(33)
memory usage: 382.6+ KB

I checked the datatypes of each column of the merged dataframe, to see if everything looked okay.

# Converting merged dataframe into a csv file

In [ ]:
df3.to_csv('Merged dataset.csv')

I converted the merged dataframe df3 into a csv file and named it 
'Merged dataset.csv'.

The next step that I had taken was to check for any errors or artefacts using 'Google Sheets'.

In [ ]:
df = pd.read_csv('Clean - Merged dataset.csv')

After I cleaned the dataset with the help of 'Google Sheets', I converted dataset back into a csv file and read it using (read_csv) and stored into df.

In [ ]:
df.describe()

,Area Code,Item Code,Y2000,Y2001,Y2002,Y2003,Y2004,Y2005,Y2006,Y2007,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
count,1042.000000,1042.000000,6.050000e+02,6.060000e+02,6.120000e+02,6.290000e+02,6.380000e+02,6.410000e+02,6.570000e+02,6.630000e+02,...,6.650000e+02,6.650000e+02,6.640000e+02,6.650000e+02,6.660000e+02,6.650000e+02,6.650000e+02,9.290000e+02,9.320000e+02,9.270000e+02
mean,138.523033,618.706334,3.283415e+05,3.121895e+05,3.025844e+05,3.037485e+05,3.174617e+05,2.970792e+05,2.973951e+05,2.775203e+05,...,2.862487e+05,2.654158e+05,2.903721e+05,2.911044e+05,3.025929e+05,3.010003e+05,2.798264e+05,2.263912e+05,2.095261e+05,2.156588e+05
std,70.381682,313.444776,1.416497e+06,1.357007e+06,1.308083e+06,1.325707e+06,1.406096e+06,1.336983e+06,1.357730e+06,1.252977e+06,...,1.273493e+06,1.159175e+06,1.302024e+06,1.288118e+06,1.350608e+06,1.345127e+06,1.236358e+06,1.164060e+06,1.082448e+06,1.136039e+06
min,3.000000,388.000000,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,...,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,80.000000,521.000000,2.000000e+03,2.000000e+03,1.856000e+03,1.423000e+03,1.485000e+03,1.305000e+03,1.345000e+03,1.126500e+03,...,1.146000e+03,1.000000e+03,1.000000e+03,9.570000e+02,1.056500e+03,1.013000e+03,1.019000e+03,0.000000e+00,0.000000e+00,0.000000e+00
50%,134.000000,542.000000,1.254700e+04,1.219400e+04,1.092600e+04,1.024400e+04,1.063050e+04,1.000000e+04,9.024000e+03,8.235000e+03,...,9.398000e+03,8.768000e+03,9.758500e+03,1.005800e+04,1.048950e+04,1.006300e+04,9.701000e+03,1.630000e+03,1.525000e+03,1.580000e+03
75%,198.000000,567.000000,1.131000e+05,1.015048e+05,9.600250e+04,9.527800e+04,8.350225e+04,8.433100e+04,8.051000e+04,7.210000e+04,...,8.275600e+04,7.130000e+04,7.861925e+04,7.700000e+04,9.045600e+04,8.500800e+04,8.051000e+04,3.850000e+04,3.527750e+04,3.688850e+04
max,273.000000,1804.000000,1.906858e+07,1.904079e+07,1.776720e+07,1.972531e+07,1.922080e+07,1.934716e+07,1.926289e+07,1.836701e+07,...,1.849314e+07,1.641497e+07,1.960578e+07,1.934760e+07,1.971815e+07,1.946686e+07,1.848497e+07,2.000002e+07,1.831765e+07,1.947107e+07

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1042 entries, 0 to 1041
Data columns (total 46 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Area Code  1042 non-null   int64
 1   Area       1042 non-null   object
 2   Item Code  1042 non-null   int64
 3   Item       1042 non-null   object
 4   Y2000      605 non-null    float64
 5   Y2000F     265 non-null    object
 6   Y2001      606 non-null    float64
 7   Y2001F     252 non-null    object
 8   Y2002      612 non-null    float64
 9   Y2002F     260 non-null    object
 10  Y2003      629 non-null    float64
 11  Y2003F     223 non-null    object
 12  Y2004      638 non-null    float64
 13  Y2004F     228 non-null    object
 14  Y2005      641 non-null    float64
 15  Y2005F     214 non-null    object
 16  Y2006      657 non-null    float64
 17  Y2006F     225 non-null    object
 18  Y2007      663 non-null    float64
 19  Y2007F     224 non-null    object
 20  Y2008      664 non-null    float64
 21  Y2008F     225 non-null    object
 22  Y2009      664 non-null    float64
 23  Y2009F     218 non-null    object
 24  Y2010      665 non-null    float64
 25  Y2010F     206 non-null    object
 26  Y2011      665 non-null    float64
 27  Y2011F     209 non-null    object
 28  Y2012      665 non-null    float64
 29  Y2012F     204 non-null    object
 30  Y2013      664 non-null    float64
 31  Y2013F     205 non-null    object
 32  Y2014      665 non-null    float64
 33  Y2014F     204 non-null    object
 34  Y2015      666 non-null    float64
 35  Y2015F     205 non-null    object
 36  Y2016      665 non-null    float64
 37  Y2016F     203 non-null    object
 38  Y2017      665 non-null    float64
 39  Y2017F     205 non-null    object
 40  Y2018      929 non-null    float64
 41  Y2018F     124 non-null    object
 42  Y2019      932 non-null    float64
 43  Y2019F     126 non-null    object
 44  Y2020      927 non-null    float64
 45  Y2020F     133 non-null    object
dtypes: float64(21), int64(2), object(23)
memory usage: 374.6+ KB

I checked the number of non-nulls values of each column of the dataframe to see if the structure of dataframe has matched requested data structure (given in data/raw/structure.md).

# Answer to question: "Which country has the highest total yield for apples across all years?"

"Which country has the highest total yield for apples across all years?"

Answer: The country that has the highest yield for apples across all years is Poland.

(The file 'country-with-highest-apple-yield.md' in the notebooks folder, shows how I got this answer).